<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=bce823137b1bd5ebb42370a3957ec481144644eb]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=230e7f2d094c856a5a11752253c2cec5f002caac]
module.lambda_functions.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_cloudwatch_logs_policy-dev]
module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_dynamodb_batchwrite_policy-dev]
module.lambda_functions.aws_iam_role.populate_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_iam_policy.daily_coffee: Refreshing state... [id=arn:aws:iam::057149530255:policy/terraform_lambda_daily_coffee-dev]
module.dynamodb_tables.aws_dynamodb_table.tier_list: Refreshing state... [id=tier_list-dev]
module.lambda_functions.aws_iam_role.daily_coffee: Refreshing state... [id=lambda_daily_coffee_role-dev]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_policy: Refreshing state... [id=lambda_daily_coffee_role-dev-20231115195101112400000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635588900000003]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs: Refreshing state... [id=lambda_daily_coffee_role-dev-20231113184635539100000001]
module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs: Refreshing state... [id=lambda_populate_coffee_pool_role-dev-20231113184635579200000002]
module.api_app.aws_api_gateway_api_key.this: Refreshing state... [id=ga9l41p0v9]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=xlmm2z]
module.api_app.aws_api_gateway_method.get_daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-xlmm2z-GET]
module.api_app.aws_api_gateway_method.opt_daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-xlmm2z-OPTIONS]
module.api_app.aws_api_gateway_integration.get_daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-xlmm2z-GET]
module.api_app.aws_api_gateway_method_response.opt_daily_coffee: Refreshing state... [id=agmr-jfrfryrkn3-xlmm2z-OPTIONS-200]
module.api_app.aws_api_gateway_integration.opt_daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-xlmm2z-OPTIONS]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_integration_response.opt_daily_coffee: Refreshing state... [id=agir-jfrfryrkn3-xlmm2z-OPTIONS-200]
module.api_app.aws_api_gateway_deployment.this: Refreshing state... [id=skyh3v]
module.api_app.aws_api_gateway_stage.this: Refreshing state... [id=ags-jfrfryrkn3-dev]
module.api_app.aws_api_gateway_usage_plan.this: Refreshing state... [id=42vl6e]
module.api_app.aws_api_gateway_usage_plan_key.this: Refreshing state... [id=ga9l41p0v9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api_app.aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2023-12-03T17:10:48Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-2:057149530255:jfrfryrkn3/" -> (known after apply)
      ~ id            = "skyh3v" -> (known after apply)
      ~ invoke_url    = "https://jfrfryrkn3.execute-api.eu-south-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "2be88ca4242c76e8253ac62474851065032d6833" -> "df50e429ce2d335b9f8e49d03a1ca1a356a8def3"
        }
        # (1 unchanged attribute hidden)
    }

  # module.api_app.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "skyh3v" -> (known after apply)
        id                    = "ags-jfrfryrkn3-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`